wisteria-1c/Конфигурация/Catalogs/КонтактыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактыЛидов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лиды</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантЗавершенияРаботыСЛидом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантЗавершенияРаботыСЛидом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереведенВПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекачественныйЛид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЛидов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервичноеОбращение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноеОбращение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИнициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КонтактыЛидов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыКонтактнойИнформации.ИмяЭлементаДляРазмещения = Элементы.ГруппаКонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Если Параметры.Свойство("Владелец") Тогда 
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;  
	Если Параметры.Свойство("БлокироватьВидимостьКодаВладельца") Тогда 
		Элементы.Владелец.Доступность = Ложь;
		Элементы.Код.Видимость = Ложь;
	КонецЕсли; 
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
        Элементы.ДублиНаименование.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	КонецЕсли;
	
	УстановитьНастройкиКонтроляДублей();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу
		Или ДублиКИ.Количество() > 0 Тогда
		ПоказатьПредупреждениеОДублях();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_КонтактЛидовКИ", Новый Структура("Лид, Контакт", Объект.Владелец, Объект.Ссылка))
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ПроверятьПредставлениеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) Тогда
		Элементы.ДублиНаименование.Видимость = Ложь;
		Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Возврат;
	КонецЕсли;
	
	НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	ПроверитьНаДубли("Наименование");
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиНаименованиеНажатие(Элемент)

	ПараметрыДублей = Новый Структура;
	
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура УстановитьНастройкиКонтроляДублей()
	
	Элементы.ДублиНаименование.Видимость       = Ложь;
	Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;  
	
	НастройкиКонтроляДублейЛиды = Константы.НастройкиКонтроляДублейЛиды.Получить().Получить();
	
	Если НастройкиКонтроляДублейЛиды <> Неопределено Тогда
		ПроверятьПредставлениеНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьНаименование");
		ПроверятьЮрНазваниеНаДубли    = НастройкиКонтроляДублейЛиды.Получить("ПроверятьЮрНазвание");
		ПроверятьНомерТелефонаНаДубли = НастройкиКонтроляДублейЛиды.Получить("ПроверятьТелефон");
		ПроверятьАдресЭПНаДубли       = НастройкиКонтроляДублейЛиды.Получить("ПроверятьАдресЭП");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(ИмяЭлемента)
	
	ЭтоРедактированиеПоляКИ = Не СтрНачинаетсяС(НРег(ИмяЭлемента), НРег("Комментарий"));
	Если ЭтоРедактированиеПоляКИ Тогда
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
		ДанныеКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеКИ);
		ИндексыКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("0");
		
		ПроверитьКИНаДубли(ДанныеКИ, ИндексыКИ);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПроверитьНаДубли(Реквизит)
	
	Если Реквизит = "Наименование" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)";
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.Наименование ПОДОБНО &Наименование";
		
		ЗапросКонтакты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
		Результат = ЗапросКонтакты.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			ЗапросЛиды = Новый Запрос;
			ЗапросЛиды.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Лиды КАК Лиды
			|ГДЕ
			|	НЕ Лиды.Ссылка = &Ссылка
			|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
			|	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
			|	И (Лиды.Наименование ПОДОБНО &Наименование
			|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)";
			
			Если Реквизит = "Наименование" Тогда
				
				ЗапросЛиды.Текст = СтрЗаменить(ЗапросЛиды.Текст,
				"	И Лиды.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|	И (Лиды.Наименование ПОДОБНО &Наименование
				|			ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование)",
				"	И ВЫБОР
				|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
				|				ТОГДА Лиды.Наименование ПОДОБНО &Наименование
				|			ИНАЧЕ Лиды.Наименование ПОДОБНО &Наименование
				|					ИЛИ Лиды.НаименованиеКомпании ПОДОБНО &Наименование
				|		КОНЕЦ");
				
			КонецЕсли;
			
			ЗапросЛиды.УстановитьПараметр("Ссылка", Объект.Владелец);
			ЗапросЛиды.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
			Результат = ЗапросЛиды.Выполнить();
			
		КонецЕсли;
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Если Реквизит = "Наименование" Тогда
		Если НЕ Результат.Пустой() Тогда
			Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Иначе
			Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		КонецЕсли;
	Иначе
		Элементы["Дубли"+Реквизит].Видимость = НЕ Результат.Пустой();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеДляПоискаДублей(Наименование)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Наименование))Тогда
		Возврат "";
	КонецЕсли;
	
	ПоисковоеВыражение = ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование);
	
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "-", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, " ", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "(", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ")", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ".", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	
	Возврат СокрЛП("%"+ПоисковоеВыражение+"%");
	
КонецФункции

&НаСервере
Процедура ПроверитьКИНаДубли(ДанныеВсехКИ, ИндексыКЛ) 
	
	//ДанныеВсехКИ = Новый Массив;
	//Для каждого ДанныеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
	//	//Если СтрНачинаетсяС(ДанныеКИ.ИмяЭлементаДляРазмещения, "КонтактнаяИнформацияКонтакт_") Тогда
	//		ДанныеВсехКИ.Добавить(ДанныеКИ);
	//	//КонецЕсли;
	//КонецЦикла;
	//
	//ИндексыКЛ = Новый Массив;
	//ИндексыКЛ.Добавить("0");
	
	Индекс = 0;
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ИндексКЛ = ИндексыКЛ[Индекс];
		
		Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) И ДублиКИ.Количество() <> 0 Тогда
			УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеКИ.Представление) Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		ТипКИАдресЭП = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ТипКИНомер = Перечисления.ТипыКонтактнойИнформации.Телефон;
		
		Если ДанныеКИ.Тип <> ТипКИАдресЭП И ДанныеКИ.Тип <> ТипКИНомер Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКИ.Тип = ТипКИАдресЭП И НЕ ПроверятьАдресЭПНаДубли Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКИ.Тип = ТипКИНомер И НЕ ПроверятьНомерТелефонаНаДубли Тогда
			ДанныеВсехКИ.Удалить(Индекс);
			ИндексыКЛ.Удалить(Индекс);
			КоличествоЭлементов = КоличествоЭлементов - 1;
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если КоличествоЭлементов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			
			ПоисковоеВыражение = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ДанныеКИ.Представление);
			ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "+", "");
			Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Тогда
				ПоисковоеВыражение = Сред(ПоисковоеВыражение, 2, СтрДлина(ПоисковоеВыражение) - 1);
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
			
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Если КоличествоЭлементов = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.АдресЭПДляПоиска ПОДОБНО &ПредставлениеКИ";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Если КоличествоЭлементов = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
		
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ПоисковоеВыражение = ДанныеКИ.Представление;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лиды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	НЕ Лиды.Ссылка = &Ссылка
		|	И Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
		|	И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.АдресЭПДляПоиска, Лиды.АдресЭПДляПоиска)
		|			ИНАЧЕ Лиды.АдресЭПДляПоиска
		|		КОНЕЦ ПОДОБНО &ПредставлениеКИ";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, "&ПредставлениеКИ", СтрШаблон("&ПредставлениеКИ%1", Индекс));
		
		Если ДанныеКИ.Тип = ТипКИНомер Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АдресЭП", "НомерТелефона");
		КонецЕсли;
		
		Запрос.Текст = СтрШаблон(
		"%1%2%3",
		Запрос.Текст,
		ТекстЗапроса,
		РазделительПакетаЗапросов);
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр(СтрШаблон("ПредставлениеКИ%1", Индекс), "%" + ПоисковоеВыражение + "%");
		
	КонецЦикла;
	
	ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗапросДублейКИ(Запрос, ДанныеВсехКИ, ИндексыКЛ)
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Индекс = 0;
	КоличествоЭлементов = ДанныеВсехКИ.Количество();
	Пока Индекс < КоличествоЭлементов Цикл
		
		РезультатЗапроса = РезультатыЗапросов[Индекс];
		ДанныеКИ = ДанныеВсехКИ[Индекс];
		ИндексКЛ = ИндексыКЛ[Индекс];
		
		ЕстьДубли = Не РезультатЗапроса.Пустой();
		ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ);
		
		Если Не ЕстьДубли Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		
		ДанныеВсехКИ.Удалить(Индекс);
		ИндексыКЛ.Удалить(Индекс);
		КоличествоЭлементов = КоличествоЭлементов - 1;
		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ПоказатьСкрытьНадписьОДубляхКИ(ДанныеКИ, ЕстьДубли, ИндексКЛ = Неопределено)
	
	УдалитьНеактивныеДублиИЭлементы(ИндексКЛ);
	
	Дубли = ДублиКИ.НайтиСтроки(Новый Структура("Представление", ДанныеКИ.Представление));
	
	Если Дубли.Количество() <> 0 Тогда
		СообщениеОДублях = Элементы.Найти("СообщениеОДублях_" + Строка(Дубли[0].ИндексДекорации));
		СообщениеОДублях.Видимость = ЕстьДубли;
		Возврат;
	КонецЕсли;

	Если НЕ ЕстьДубли Тогда
		Возврат;
	КонецЕсли;
	
	ДублиКИ.Сортировать("ИндексДекорации УБЫВ");
	
	НовыйДубль = ДублиКИ.Добавить();
	НовыйДубль.ИмяЭлемента     = ДанныеКИ.ИмяРеквизита;
	НовыйДубль.ТипКИ           = ДанныеКИ.Тип;
	НовыйДубль.Представление   = ДанныеКИ.Представление;
	НовыйДубль.ИндексДекорации = ДублиКИ[0].ИндексДекорации + 1;
	НовыйДубль.ЭтоДубльКЛ      = ?(ИндексКЛ = Неопределено, Ложь, Истина);
	НовыйДубль.ИндексКЛ        = ?(ИндексКЛ = Неопределено, 0, ИндексКЛ);
	
	ГруппаЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель.Родитель;
	ГруппаТекущегоЗначенияКИ = Элементы[ДанныеКИ.ИмяРеквизита].Родитель;
	ГруппаСоседнегоЗначенияКИ = УправлениеКонтактнойИнформациейУНФ.СледующийЭлементВКоллекцииПочиненных(ГруппаЗначенияКИ.ПодчиненныеЭлементы, ГруппаТекущегоЗначенияКИ);
	
	СообщениеОДублях = Элементы.Добавить("СообщениеОДублях_" + Строка(НовыйДубль.ИндексДекорации), Тип("ДекорацияФормы"), ГруппаЗначенияКИ);
	СообщениеОДублях.Заголовок = СообщенияОДубляхКИПоТипу(ДанныеКИ.Тип);
	СообщениеОДублях.Гиперссылка = Истина;
	СообщениеОДублях.УстановитьДействие("Нажатие", "Подключаемый_СообщениеОДубляхНажатие");
	СообщениеОДублях.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	
	Если ГруппаСоседнегоЗначенияКИ <> Неопределено Тогда
		Элементы.Переместить(СообщениеОДублях, ГруппаЗначенияКИ, ГруппаСоседнегоЗначенияКИ);
	КонецЕсли;
		
	СообщениеОДублях.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНеактивныеДублиИЭлементы(ИндексКЛ = Неопределено)
	
	Если ДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИндекс = ДублиКИ.Количество() - 1;
	
	Пока ТекущийИндекс >= 0 Цикл
		
		Дубль = ДублиКИ[ТекущийИндекс];
		ТекущийИндекс = ТекущийИндекс - 1;
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ = Неопределено И Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИндексКЛ <> Неопределено И НЕ Дубль.ЭтоДубльКЛ Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФ.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
		Если ОписаниеКИ.Представление = Дубль.Представление Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
		ДублиКИ.Удалить(ДублиКИ.Индекс(Дубль));
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция СообщенияОДубляхКИПоТипу(Тип)
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Возврат НСтр("ru = 'Найдены дубли по e-mail'");
	КонецЕсли;
	
	Если Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
		Возврат НСтр("ru = 'Найдены дубли по номеру телефона'");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_СообщениеОДубляхНажатие(Элемент)
	
	ПоложениеИндекса = СтрНайти(Элемент.Имя, "_", НаправлениеПоиска.СКонца);
	ИндексДекорации  = Число(Сред(Элемент.Имя, ПоложениеИндекса+1));
	
	СтрокиДублиКИ = ДублиКИ.НайтиСтроки(Новый Структура("ИндексДекорации", ИндексДекорации));
	Если СтрокиДублиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Дубль = СтрокиДублиКИ[0];
	
	ДанныеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Дубль.ИмяЭлемента);
	Если ДанныеКИ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;

	МассивКонтактов.Добавить(Объект.Ссылка);
	
	ПараметрыДублей.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
	ПараметрыДублей.Вставить("ТипКИ",           ДанныеКИ.Тип);
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	ПараметрыДублей.Вставить("БлокироватьСвязьСКонтрагентом", Истина);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДанныеКИ", ДанныеКИ);
                                                                                             
	ОткрытьФорму("Справочник.Лиды.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьПредупреждениеОДублях()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПредупреждениеДублей",ЭтотОбъект);
	ТекстПредупреждения = ТекстПредупрежденияПоДублям();

	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Проигнорировать и записать'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстПредупреждения, СписокКнопок,,КодВозвратаДиалога.Отмена, НСтр("ru = 'Контроль дублей'"));
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыПредупреждениеДублей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЭлементыДублейКИ();
	Элементы.ДублиНаименование.Видимость = Ложь;
	Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	
	Записать();
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьЭлементыДублейКИ()
	
	Для Каждого Дубль Из ДублиКИ Цикл
		Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
	КонецЦикла;
	
	ДублиКИ.Очистить();
	
КонецПроцедуры


Функция ТекстПредупрежденияПоДублям(СообщениеПриЗаписи = Ложь)
	
	МассивСтрок = Новый Массив;
	
	Если Элементы.Наименование.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу Тогда
		МассивСтрок.Добавить(НСтр("ru = 'представлению'"));
	КонецЕсли;
			
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	ДублиПоНомеру = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоНомеру.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'номеру телефона'"));
	КонецЕсли;
	
	Отбор = Новый Структура("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	ДублиПоАдресуЭП = ДублиКИ.НайтиСтроки(Отбор);
	Если ДублиПоАдресуЭП.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'e-mail'"));
	КонецЕсли;
	
	Если СообщениеПриЗаписи Тогда
		Возврат СтрШаблон(НСтр("ru = 'Проигнорировано сообщение о дублировании информации по%1%2'"),
		Символы.НПП,
		СтрСоединить(МассивСтрок, ", "));
	Иначе
		Возврат СтрШаблон(НСтр("ru = 'Найдены дубли по%1%2'"),
		Символы.НПП,
		СтрСоединить(МассивСтрок, ", "));
	КонецЕсли;
	
КонецФункции
// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент); 
	
	ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Элемент.Имя);
	Если ОписаниеРеквизита = Неопределено И СтрНачинаетсяС(НРег(Элемент.Имя), НРег("Комментарий")) Тогда
		ИмяЭлемента = Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("Комментарий"));
		ОписаниеРеквизита = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, ИмяЭлемента);
	КонецЕсли;
	
	Если ОписаниеРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлементаДляРазмещения = ОписаниеРеквизита.ИмяЭлементаДляРазмещения;
	Если ИмяЭлементаДляРазмещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтактнаяИнформацияКонтактногоЛицаПриИзмененииСервер(Элемент.Имя);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	УправлениеКонтактнойИнформациейУНФ.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, , Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти
